{
  "title": "inAIR 구축/유지보수",
  "term": "2019.07 ~ 2020.03",
  "info": {
    "client": "마이다스아이티",
    "role": "Front-End 개발",
    "devenv": "HTML5, CSS3, JavaScript(es6), jQuery",
    "category": "WEBSOLUTION"
  },
  "thumbnailType": "right",
  "thumbnail": ["/resource/img/thumbnail/inair1.png", "/resource/img/thumbnail/inair2.png", "/resource/img/thumbnail/inair3.png"],
  "result": "<h2>inSight, AI면접 관리자, inSEED 관리자 등 inAIR 제품 유지보수 및 신규개발 (2019.07 ~ 2020.03)</h2> <p>2019년 2월, 웹사이트를 수주 및 구축하던 디지털사업팀이 해체되어 inAIR TFT가 종료된 후 채용 토탈솔루션 inAIR를 개발하는 inAIR개발팀으로 옮기게 되었습니다. 2019년 7월부터 2020년 3월까지 inAIR를 구성하는 inSight(채용솔루션), AI면접 관리자, inSEED(인적성검사) 관리자 등 여러 제품들의 유지보수 및 신규개발(마이너, 메이저)을 담당하였습니다.</p> <h2>inTASK 리팩토링 (2019.10 ~ 2019.11)</h2> <h3>담당 작업</h3> <p>마이다스아이티 내부에서 사용하는 inTASK라는 제품에서 유지보수가 어렵고, 정상적으로 동작하지 않는 기능이 존재하며 사용성이 떨어지는 문제가 있어 리팩토링을 진행하게 되었습니다.</p> <h4>1. 기능 개선</h4> <ul> <li>수정 버튼 클릭 시 해당 콜럼의 DOM 데이터를 긁어와 모달 팝업에 노출하는 방법 개선<br/> → 갱신된 데이터가 아닐 수 있기 때문에 상세보기 / 수정 버튼 클릭 시 해당 데이터를 조회하는 API 요청 후 데이터 바인딩 하도록 수정함</li> <li>정상적으로 동작하지 않는 API 선별 및 추가 개발에 필요한 API 목록 정리하여 백엔드 개발자께 요청함</li> <li>기존에 API 요청 시 발생하는 에러 상황에 대한 앨럿이 잘 노출되지 않는 현상 개선</li> <li>템플릿과 데이터 바인딩을 분리시켜 입력필드 추가/수정에 유연하게 대처할 수 있도록 구현 함</li> </ul> <h4>2. UI/UX 개선</h4> <ul> <li>나열되어 있던 테이블들을 탭으로 변경하여 해당 항목에 대한 데이터를 한눈에 볼 수 있도록 변경</li> <li>사용자 행동 플로우대로 UI 배치를 변경하여 사용성 증대</li> <li>순서를 정하기 위해 직접 입력필드에서 숫자를 입력해야 하던 형태를 드래그&드랍 UI으로 변경하여 사용성 증대</li> <li>페이징을 도입하여 길게 나열된 데이터들을 한 눈에 볼 수 있도록 수정함</li> </ul> <h4>3. 유지보수 용이하도록 개선</h4> <ul> <li>폴더 / 파일 네이밍 정리</li> <li>부트스트랩 제거 및 내부 스타일 가이드로 변경</li> <li>기능별로 스크립트 코드 분리 및 구조화</li> </ul> <h3>느낀점</h3> <p>inTASK 개발자가 퇴사하면서 유지보수 업무가 저희 파트로 넘어왔고 inTASK가 처한 상황을 알게 되었습니다. 처음 담당했던 후배가 inTASK 유지보수에 어려움이 있다고 하여 상황 파악을 위해 제가 투입되었는데, 부트스트랩으로 만들어져 다른 제품군들과 스타일 및 UI 통일성이 없는 문제도 있었지만 기능 버그들이 있어 리팩토링을 하기로 결심하였습니다. 남겨진 코드로 로직과 히스토리를 파악해야하는 어려움이 있었지만, 무엇보다 inTASK는 문항을 생성하는 중요한 솔루션이었기 때문에 더욱 무거운 책임감을 가지고 작업하였습니다.</p> <p>리팩토링을 진행하며 중요하게 생각했던 점은 오류가 있던 기능을 개선하는 것과 기존에 사용하는데 있어 불편함이 많았다는 의견이 있어 사용성 개선이었습니다. 또한, 제가 아닌 다른 동료들도 유지보수 하기 쉽도록 구현하기 위해 노력하였습니다.  사용성 증대를 위해 고민하며 기획자분께 기존 제품 사용시 어떤 점이 불편하였는지 어떤 점이 개선되면 하는지를 여쭤보았고, 리팩토링 후 기획자분과 사용성이 좋아졌는지 확인할 수 있었습니다. inTASK는 내부 기획자분들이 사용하는 솔루션이었기 때문에 피드백을 바로 받을 수 있는 점이 좋았지만 한편으론 초기 기획 당시부터 사용성에 대한 고려가 충분히 이루어졌으면 어땠을까 하는 아쉬움도 있었습니다.</p> <p>inTASK 리팩토링을 통해 프론트 개발뿐만 아니라 기획, 백엔드 개발에 관련된 부분들도 챙겨서 해보며 다른 분들과 소통하며 배우는 것도 크다는 것을 알게 되었고, 프로젝트의 성공적인 구축을 위해 더 적극적으로 소통해야겠다고 다짐하게 되었습니다.</p> <h2>HR 파트너사이트 리팩토링 (2019.07 ~ 2019.07)</h2> <p>마이다스아이티의 주 제품인 채용토탈 솔루션 inAIR를 사용하기 위해 고객사의 회원 가입을 진행하는 HR 파트너 사이트의 리팩토링 작업을 진행하였습니다.</p> <h3>담당 작업</h3> <h4>1. 개편된 디자인으로 변경</h4> <p>올해 초에 오픈된 inAIR 웹사이트 컨셉에 맞춰 HR 파트너 사이트의 디자인도 전체적으로 개편되어 이를 반영하고, 새로 추가된 페이지 및 비밀번호 UI/UX 개선 작업도 함께 진행하였습니다.</p> <h4>2. 유효성 검사 UI/UX 개선</h4> <p>기존의 유효성 검사는 아이디, 비밀번호 입력 필드 하단에 문구로 안내하는 형태였다면, 개선된 유효성 검사는 안내 문구와 함께 아이디 중복 여부와 비밀번호 사용 가능 여부를 입력 필드 우측에 레이블로 표시합니다. 또한, 비밀번호는 준수해야 할 항목들을 레이어에 띄운 후 실시간으로 준수된 항목들을 활성화 시켜 사용자에게 비밀번호를 생성하기 위해 현재까지 어떠한 규칙을 준수했는지 보여주도록 변경하였습니다.</p> <p>기존에 다른 제품들과 공통으로 사용하는 유효성 검사 라이브러리로 구현되어 있었기 때문에 파트너 사이트에서만 별도로 라이브러리를 수정할 수가 없어 validatorLabelMsg.js를 만들어 라이브러리에서 리턴하는 유효성 검사 결과 object를 받아와 유효성 문구, 레이블, 레이어 형태로 노출될 수 있도록 구현하였습니다.</p> <p>실제로 파트너 사이트 이후에 inSight, interview 관리자, inSEED 관리자 등 전 제품의 비밀번호 UX 개선 작업에 validatorLabelMsg를 사용하여 빠르고 쉽게 구현할 수 있었습니다.</p> <h4>3. 모션 작업을 통해 솔루션 퀄리티 증대</h4> <p>메인 디자인이 제품의 비주얼적인 요소를 강조하도록 구성되어 있어 좀 더 동적인 느낌을 줄 수 있도록 모션을 추가하면 좋겠다고 판단하여 모션 작업을 진행하였습니다. 실제로 기획자와 디자이너분께 퀄리티가 높아졌다는 피드백을 받을 수 있었고, 올해 초까지 웹사이트의 모션 작업을 진행했던 경험을 솔루션에서도 발휘할 수 있어서 의미가 있었던 작업이었습니다.</p>",
  "next": {
    "name": "inAIR 홍보사이트 구축 작업",
    "link": "/project/detail/midashri"
  }
}